app/views/mainmenus/_childmenus.html.erb

SELECT "childmenus".* FROM "childmenus" WHERE "childmenus"."mainmenu_id" = ?  [["mainmenu_id", 57]]
SELECT COUNT(*) FROM "childmenus" WHERE "childmenus"."mainmenu_id" = ?  [["mainmenu_id", 36]]
---
<% if mainmenu.childmenus.count > 0 %>