app/views/mainmenus/_mainmenu.html.erb

    <ul>
      <% mainmenu.childmenus.each do |cm| %>
---
SELECT "childmenus".* FROM "childmenus" WHERE "childmenus"."mainmenu_id" = ?  [["mainmenu_id", 36]]