app/controllers/childmenus_controller.rb

SELECT "childmenus".* FROM "childmenus" WHERE "childmenus"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @childmenu = Childmenu.find(params[:id])

INSERT INTO "childmenus" ("created_at", "mainmenu_id", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 08 Dec 2014 10:17:53 UTC +00:00], ["mainmenu_id", 43], ["text", "Text"], ["title", "Child menu of third menu 03 01"], ["updated_at", Mon, 08 Dec 2014 10:17:53 UTC +00:00]]
---
  def create
    @childmenu = Childmenu.new(params.require(:childmenu).permit(:mainmenu_id, :title, :text))
    if @childmenu.save

SELECT  "childmenus".* FROM "childmenus" WHERE "childmenus"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "childmenus" WHERE "childmenus"."id" = ?  [["id", 4]]
---
  def destroy
    @delete = Childmenu.find(params[:id])
    if @delete.destroy