app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
	  @show_content = Content.find(params[:id])

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
	  @edit_content = Content.find(params[:id])

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "contents" SET "text" = ?, "updated_at" = ? WHERE "contents"."id" = 2  [["text", "dfgdfgdfgd\r\ndfgdfgdfg\r\ndfgdfgdfg\r\n<ul>\r\n  <li> text</li>\r\n  <li> text</li>\r\n</ul>"], ["updated_at", Fri, 12 Dec 2014 05:18:03 UTC +00:00]]
---
	def update
		@update = Content.find(params[:id])
		if @update.update_attributes(params.require(:content).permit(:title, :text))

INSERT INTO "contents" ("childmenu_id", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["childmenu_id", 3], ["created_at", Fri, 12 Dec 2014 05:11:25 UTC +00:00], ["text", "ntrcnsdf"], ["title", "Заголовок парент ид 3. 01"], ["updated_at", Fri, 12 Dec 2014 05:11:25 UTC +00:00]]
---
  def create
	  @create_content = Content.new(params.require(:content).permit(:childmenu_id, :title, :text))
	  #@create_content.text = replacer(@create_content.text)
	  if @create_content.save

SELECT "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "contents" WHERE "contents"."id" = ?  [["id", 3]]
---
  def destroy
	  @delete = Content.find(params[:id])
	  childmenu_id = @delete.childmenu
	  if @delete.destroy