app/controllers/home_pages_controller.rb

SELECT "mainmenus".* FROM "mainmenus" WHERE (*)  ORDER BY (case when mainmenus.ancestry is null then 0 else 1 end), mainmenus.ancestry, created_at
---
  def index
    @mainmenus = Mainmenu.all