app/controllers/home_pages_controller.rb

    end

    levels.each_with_index do |l,index|
      pages = Page.where(:level => l)
---
SELECT "pages".* FROM "pages" WHERE "pages"."level" = 0
SELECT COUNT(*) FROM "pages" WHERE "pages"."level" = 0