app/controllers/mainmenus_controller.rb

  def update
    if @mainmenu.update_attributes(params.require(:mainmenu).permit(:title, :text))
---
UPDATE "mainmenus" SET "title" = ?, "updated_at" = ? WHERE "mainmenus"."id" = ?  [["title", "COOOOL"], ["updated_at", "2016-02-26 05:48:21.144869"], ["id", 57]]

  def create
    @mainmenu = Mainmenu.new(mainmenu_params)

    if @mainmenu.parent_id.blank?
      @mainmenu.style_class = "nested_mainmenus site-dropdown-menu"
    else
      @mainmenu.style_class = "mmain"
    end

    if @mainmenu.save
---
SELECT  "mainmenus".* FROM "mainmenus" WHERE "id"."parent_id" = '53' LIMIT 1
INSERT INTO "mainmenus" ("ancestry", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ancestry", "44"], ["created_at", Mon, 08 Dec 2014 10:33:15 UTC +00:00], ["text", "text"], ["title", "Child level 02 01"], ["updated_at", Mon, 08 Dec 2014 10:33:15 UTC +00:00]]

  def destroy
    if @mainmenu.destroy
---
DELETE FROM "mainmenus" WHERE "mainmenus"."id" = ?  [["id", 46]]

  def set_mainmenu
    @mainmenu = Mainmenu.find(params[:id])
---
SELECT "mainmenus".* FROM "mainmenus" WHERE "mainmenus"."id" = ? LIMIT 1  [["id", "46"]]