app/controllers/users_controller.rb

  def index
    per_page = 15
	  if !params[:users].nil?
		  from = params[:users][:from]
		  to   = params[:users][:to]

		  p = []

		  from.each do |f|
			  if !f[1].empty?
				  #ниже делается строка запроса для выборки по диапозону или с простым условием
				  #to[f[0]].empty? ? p.push("#{f[0]} = #{f[1]}") : to[f[0]] >= f[1] ? p.push("#{f[0]} BETWEEN #{f[1]} and #{to[f[0]]}") : "no"

          if to[f[0]].empty?
	          p.push("#{f[0]} = #{f[1]}")
          else
						if to[f[0]] >= f[1]
							p.push("#{f[0]} BETWEEN #{f[1]} and #{to[f[0]]}")
						else
							"no"
						end
          end

			  end
		  end

		  p = p.join(" AND ")

      @users = User.where(p).order("age desc").paginate(page: params[:page], :per_page => per_page)
	  else
		  @users = User.paginate(page: params[:page], :per_page => per_page)
---
SELECT  "users".* FROM "users" WHERE (age BETWEEN 10 and 20 AND age BETWEEN 10 and 20 AND weigh BETWEEN 10 and 40 AND weigh BETWEEN 10 and 40)  ORDER BY age desc LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (age BETWEEN 10 and 20 AND age BETWEEN 10 and 20 AND weigh BETWEEN 10 and 40 AND weigh BETWEEN 10 and 40)
SELECT "users".* FROM "users" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"