app/views/childmenus/show.html.slim

SELECT "contents".* FROM "contents" WHERE "contents"."childmenu_id" = ?  [["childmenu_id", 6]]
---

- @childmenu.contents.each do |content|