app/views/childmenus/show.html.haml

SELECT "contents".* FROM "contents" WHERE "contents"."childmenu_id" = ?  [["childmenu_id", 3]]
---

- @childmenu.contents.each do |content|